{
    "questions": [
      {
        "id": 1,
        "title": "Do fish count as pets in a tenancy?",
        "text": "Hi, I wanted to get a tiny simple aquarium with 3 small fish, I went to a specialty store that has complete kits and got a quote for one that is one level up from the smallest/most basic. But I'm unclear as to whether this counts as having a pet, do I need to seek permission from the landlord?"
      },
      {
        "id": 2,
        "title": "Can a landlord forbid the use of curtains?",
        "text": "My daughter moved into a house that had no curtains in the kitchen, dining and living room (open plan). The windows have no rails, tracks or curtain fittings so she asked the landlord if she could put some up but was told no as it's not aesthetically pleasing. Basically, the landlord likes the look of undressed windows and doesn't want anything attached to the window frames, even temporarily. The property is unfenced and people can see into the house as they walk past. My daughter feels exposed and unsafe. Is this legal?"
      },
      {
        "id": 3,
        "title": "Landlord trying to kick me out over a Facebook post?",
        "text": "She has been messaging me great big paragraphs every single day for the past week, asking me to sort out XYZ or harassing me over using a heater. It’s been extremely stressful and I (stupidly) posted on Facebook saying how stressful my flat situation has been and that I want to leave ASAP. It wasn’t serious I was just feeling very upset and later deleted the post, but unfortunately the landlord saw it and messaged me saying it counts as my 3 weeks notice… I told her that wasn’t what my post was about but she basically said “too bad, you need to leave in the next 3 weeks”. I’m a student so I live pay check to pay check, I have a cat and no car. It is bot reasonable and probably not even possible for me to just up and leave within a few weeks. I will be out on the streets."
      },
      {
        "id": 4,
        "title": "Unfair eviction please please help me!!",
        "text": "Hello!! I (18F) moved to New Zealand on monday, however, I came here for a few weeks before moving to view homes. I came across a woman (47F) who was renting her downstairs bedroom, ensuite and walk in robe. She was also renting the house, however I was a flatmate and would not sign onto the lease. We got on well so I moved in. We established I could have friends over whenever, just no parties. I would pay her $350/wk in rent. Anyhoo, I moved in on monday having paid one week upfront. I'm not from this country and it is my first time out of home. Anyway, on the Wednesday, she told me that the house was actually under offer and we had to move out in three weeks. Would've been nice to know before I moved in but whatever The main issue came yesterday though. So on Thursday night, I went on a date which went very well with a guy I'd been speaking to and FaceTiming for weeks, and we came back to the house for sexual purposes. We were in the shower together and she turned off the water and started to yell at me about what I was doing. I told her to calm down, I'm allowed to have friends over, and in response she called over her 6'4 male friend to yell at me. I just sent my guy home and went to bed. I woke up the next morning, to her and this man standing in the kitchen. They demanded I be out hy the end of the day or I would find all my stuff c y street. They claimed I'd endangered the house. bringing home a guy, and it was unacceptable. Whilst I do see it from her point of view, I paid rent to be there and this was not discussed prior to me moving in. There was no warning, she said I had to eave now It's also worth noting, during this conversation, the man body shamed me, made comments about my promiscuity and the woman shamed my parents. So out of line for people 30 years older than me. I had no other place lined up (obviously) and I find this very unfair. I obviously couldn't carry my mattress out on my own, so she and that guy left it on the street in the middle of winter. The woman also refused to refund the rest of my rent (I was paid until Sunday), saying she would use it as a cleaning fee I'm not covered under the tenancy agreement because l'm a flatmate but surely I can get some recourse?"
      },
      {
        "id": 5,
        "title": "Notice Period",
        "text": "How much notice do I need to give for a tenancy?"
      },
      {
        "id": 6,
        "title": "Curtains",
        "text": "Can I hang my own curtains in a place I am renting?"
      },
      {
        "id": 7,
        "title": "Owner of my apartment sold, and buyer wants to move in.",
        "text": "About a month ago I moved into an apartment in Auckland CBD. I paid my bond and rent in advance, and have paid my rent on time ever since. Before moving, I signed a fixed term contract for 1 year. So, over the weekend, my landlord told me that the apartment was sold to a new buyer, and the buyer wants to move here in 6 weeks. The landlord has offered to buy me out with 4 weeks rent, but to me, that’s just giving my bond back, so it’s not really buying me out. I just feel as though I’m being kicked out to the street, and I need to find a new apartment within 6 weeks. I’m in need of a bit of guidance in regards to what my rights are. Do I have a right to demand more money or something? Thanks in advance for any help."
      },
      {
        "id": 8,
        "title": "Landlord and her builders broken my TV while working at my house",
        "text": "My landlord has brought in “builders” to fix and replace the inside ceiling of my house on the Sunday evening just gone, upon arriving back home I’ve decided to turn on the TV in my room which now has a huge crack and half the screen not displaying, I’ve told the landlord about this and she’s come back to the house with said builders at 9pm stinking of alcohol, when I have confronted them about the TV they are saying they aren’t responsible for the damage and haven’t done it, I also can’t understand anything they’re saying as they are speaking in Chinese and don’t speak English at all other than the landlords broken translations, she’s not willing to reimburse me and her builders aren’t taking responsibility, how should I take this matter further?"
      },
      {
        "id": 9,
        "title": "Landlord taking me to small claims",
        "text": "so. for the past year and a half i have been living with four flatmates, one of them owns the house. she’s moving away soon, and had given us a date to move out by since she’d found someone else to rent the house. she then changed the date on us, essentially giving us less than two weeks notice. i decided to leave immediately as she was unbearable to live with. unfortunately when i moved out i found a considerable amount of mould on the carpet and on the walls behind my furniture. i was in the sleepout, which gets extremely damp in the winter and only has one small window. i had paid a $200 bond which obviously she kept, but she is now demanding an additional $300. she has just said if i don’t pay her by the end of the week (she knows i work for minimum wage and have virtually no money, something she often gave me shit for since she earns a lot) she’ll lodge a claim with small claims court for the full total of materials and labour to fix the sleepout. she’s quoted this around $1500. but here’s the thing. there was never any sort of contract between us. no tenancy agreement or anything. the room was already in awful condition when i moved in as there was a dog living in there before me. is this something that i should really be stressing about? will small claims work? i just do not have the money to give her right now and when i told her that she suggested i find it or get my parents to pay for it (parents also do not have spare money)"
      },
      {
        "id": 10,
        "title": "Landlord visits",
        "text": "The landlord often visits the property unannounced to do work on ther property. Are they allowed to do this?"
      },
      {
        "id": 11,
        "title": "Lndlord selling house",
        "text": "The landlord is selling the house that I live in. They say they want to have viewings three times a week but I think this is unreasonable and that it should just be in the weekend. What are my rights here?"
      },
      {
        "id": 11,
        "title": "What are my rights when living in a rental property?",
        "text": "So me and my now ex have gone our separate ways in our place that we rent out to live in. We’re both on the lease, both paid the bond equally, however, she hasn’t paid rent since September. Ive told her I’m gonna have to set a date of 1st February to leave the house and break the lease as I think over 4 weeks is fair to get something else sorted for the both of us. She said she might not leave the house, but I know for a fact she won’t be able to pay the rent on this and I’m on my last dollars paying for the both of us for so long, so I’m just wondering what will happen in this situation if she just stays in the house and doesn’t pay? I can’t afford to pay as I’ll be paying rent at a new place from then. I don’t want to see her screwed in anyway, maybe she just doesn’t realise she can’t just stay in someone’s property without paying. Is there a chance we could both get billed? I’m aware our security deposit would be taken off as well if the rent wasn’t paid up. Just not sure how all this works. I’ve already been screwed financially through this so just making sure nothing can go really bad, for either of us for that matter. Many thanks."      
      },
      {
        "id": 12,
        "title": "Landlord terminating tenancy",
        "text": "Can a landlord end a fixed term tenancy?"
      },
      {
        "id": 13,
        "title": "Unlawful tenancy conditions",
        "text": "What conditions of a tenancy are unlawful?"
      },
      {
        "id": 14,
        "title": "Modifications",
        "text": "Can I make a modifications to a property?"
      },
      {
        "id": 15,
        "title": "Minor modifications",
        "text": "What counts as a minor modification for a property?"
      },
      {
        "id": 16,
        "title": "Carpet cleaning",
        "text": "Can I be charged for carpet cleaning when I end the tenancy?"
      },
      {
        "id": 17,
        "title": "Inspection",
        "text": "How much notice does a landlord need to provide for an inspection?"
      },
      {
        "id": 18,
        "title": "Emptying bins",
        "text": "Do I need to empty bins at the end of a tenancy?"
      }
    ]
  }
  